{"title":"Publier son site","content":"<!--héberger son site web mettre son site web en ligne mettre son site web sur internet publier son site web hébergeur héberger FTP FileZilla filezilla File Zilla file zilla transfert transférer transféré-->\n<p>\n    Nous y voilà enfin ! Vous avez créé votre site, écrit le HTML et le CSS, tout vous satisfait. Cela n'a pas toujours été facile, mais maintenant, vous voudriez partarger les efforts de votre travail.\n<\/p>\n\n<p>\n    Pour cela vous aurez recours aux hébergeurs (sauf si vous préférez héberger votre site web chez vous ce qui est un peu plus compliqué !).\n<\/p>\n\n<b>On distinguera deux choses : le stockage de votre site sur un serveur distant et l'adresse de votre site.<\/b><br><br>\n<i>NB: si le stockage peut-être gratuit, l'adresse avec un nom de domaine (et non de sous-domaine) sera toujours payante !<\/i>\n\n<br><br>\n\n<h5>Un serveur ?<\/h5>\n<p>\n    Jusqu'à présent, pour que votre site <b>vous<\/b> soit accessible, il vous suffisait que votre ordinateur soit en route. C'est exactement pareil pour qu'il soit accessible à tout le monde ! Sauf que laisser allumer son ordinateur en permanence, ce n'est pas terrible ! C'est pour cela qu'il existe les \"serveurs\". Ce sont des ordinateurs sans écran dont la seule fonction est d'héberger des pages web. Cette page que vous lisez est hébergée sur un seveur.\n<\/p>\n\n<h5>Un hébergeur ?<\/h5>\n<p>\n    On appelle hébergeur l'organisation qui rend articleViewVisible sur internet votre site web. Pour cela, vous devez lui communiquer les fichiers que vous avez écris en HTML, CSS et tous les documents complémentaires: photo, gifs, vidéos ou musique.\n<\/p>\n<p>\n    Puis, vous choisissez une adresse pour votre site et vous n'avez plus qu'à la donner à vos amis pour qu'ils puissent venir voir votre site !\n<\/p>\n\n<h5>Un nom de domaine ?<\/h5>\n<p>\n    En choisissant un hébergeur gratuit, l'adresse de votre site ne ressemblera pas à \"www.mon-site.fr\" mais plutôt à \"www.mon-site.hebergeur.com\". Vous aurez un sous-nom de domaine : \".hebergeur.com\" au lieu du nom de domaine \".com\".\n<\/p>\n<p>\n    Vous pouvez évidemment acheter, souvent pour une période d'un an, un nom de domaine personnalisé (www.mon-site.org par exemple). Cela coût en général de 5 à 20€ par an.\n<\/p>\n\n<h5>Un accès \"FTP\" ?<\/h5>\n<p>\n    Vous avez déjà créé votre site. Un client FTP (pour File Transfer Protocol) vous permet par un simple glisser-déposer de mettre votre site en ligne et de le mettre à jour. C'est un gain de temps précieux !\n<\/p>\n<p>Un FTP populaire est <a href=\"https:\/\/filezilla-project.org\/\" target=\"_blank\">FileZilla<\/a>, je vous montre plus loin comment l'utiliser !<\/p>\n\n<hr>\n\n<h4>Les hébergeurs gratuits<\/h4>\n<p>\n    Voilà une liste de site web vous proposant d'héberger gratuitement votre site. Je vous conseille de commencer par un hébergeur gratuit pour tester votre site \"en vrai\".\n<\/p>\n<i>NB: comme les services ci-dessous sont gratuits, certaines fonctionnalités sont \"réduites\": le stockage ou les pubs sont des problèmes courants<\/i>\n<ul>\n    <li><b>000webhostapp<\/b> => pas de pubs, 1.5go d'espace de stockage. Le meilleur des gratuits selon moi.<\/li>\n    <li><b>github<\/b> => pas de pubs, espace de stokage illimité mais mise en route compliquée et pas de FTP (voir ci-dessus)<\/li>\n    <li><b>AwardSpace<\/b> => ressemble à 000webhostapp mais en moins intuitif. Non testé.<\/li>\n    <li>...<\/li>\n<\/ul>\n<h4>Les hébergeurs payants<\/h4>\n<p>\n    Le plus connu des hébergeurs français est OVH. Vous pouvez y acheter du stockage ou un nom de domaine. Si vous avez choisi 000webhostapp, je vous conseille de simplement prendre un petit nom de domaine pas trop cher (on arrive à en trouver pour 2€ en soldes!).\n<\/p>\n<p>\n    OVH propose aussi de l'hébergement pour 1.8€ par mois (TTC) mais encore une fois, l'intérêt reste faible, sauf si votre site attire beaucoup de trafic, auquel cas les serveurs de 000webhostapp pourraient vous demander de payer. (au delà des 100 affichages de page web par seconde).\n<\/p>\n\n<hr>\n\n<h4>000webhostapp, c'est parti !<\/h4>\n\n<p>\n    J'ai choisi cet hébergeur car il ne rajoute pas de pub, offre un espace de stockage comfortable, un accès FTP (un peu faiblard mais bon...) et pour ceux qui seraient intéressés, il gère le PHP et les bases de donnée !\n<\/p>\n\n<h5>Créer un compte<\/h5>\n<br>\n<i>NB: vous pourrez changer le nom de votre site (Website Name) plus tard !<\/i>\n<br><br>\n<img src=\"img\/res\/host0.PNG\">\n<br><br>\n<img src=\"img\/res\/host1.PNG\" class=\"small\">\n<br>\n<i>\nVous arrivez directement ici ! Pensez à valider votre compte en allant dans votre boite mail.\n<\/i><br><br>\n<img src=\"img\/res\/host2.PNG\">\n<p>L'email de validation<\/p>\n<br>\n<img src=\"img\/res\/host3.PNG\">\n<p>Email confirmé !<\/p>\n<img src=\"img\/res\/host4.PNG\">\n<p>Configurons un peu notre hébergeur ! Allez dans <b>paramètres<\/b> puis <b>général<\/b><\/p>\n<img src=\"img\/res\/host5.PNG\" class=\"small\">\n<img src=\"img\/res\/host6.PNG\" class=\"small\">\n<p>Désactivez ces deux options...<\/p>\n<br>\n<hr>\n<img src=\"img\/res\/host9.PNG\" class=\"small\">\n<p>Cliquez sur <b>télécharger des fichiers<\/b>, puis <b>Télécharger des fichiers maintenant<\/b> vous arriverez sur cet écran !<\/p>\n<p>Vous pouvez aussi suivre <a href=\"https:\/\/files.000webhost.com\/\" target=\"_blank\">ce lien<\/a><\/p>\n<img src=\"img\/res\/host10.PNG\" class=\"small\">\n<p>Double-cliquez sur <b>public-html<\/b><\/p>\n<img src=\"img\/res\/host11.PNG\" class=\"small\">\n<br>\n<b>Et maintenant me direz-vous ? Faites simplement glisser tous vos fichiers ici !<\/b>\n<hr>\n<h4>Configurer FileZilla<\/h4>\n<br>\n<br>\n<i>NB: en cours de rédaction !<\/i>\n<br>\n<p>\n    Commencez par télécharger FileZilla puis installez le sur votre ordinateur. Je conseille de créer un raccourci sur le bureau, vous gagnerez du temps !\n<\/p>\n<h5>Ouvrez FileZilla :<\/h5>\n<img src=\"img\/res\/filezilla0.PNG\" class=\"small\">\n<p>\n    Dans le ruban en haut, en face de <b>hôte<\/b>, écrivez : \"files.000webhost.com\"; en face de <b>identifiant<\/b>, renseignez le nom de votre site web. Finalement, pour le mot de passe, entrez celui de votre site web (celui que vous avez donné pour vous inscrire). Laissez le champ <b>port<\/b> vide.\n<\/p>\n<p>\n    Cliquez sur <b>Connexion rapide<\/b> et regardez le panneau en bas à  droite (affichant \"absence de connexion à un serveur\" sur l'illustration) : vous y retrouverez le dossier \"public-html\".\n<\/p>\n<p>\n    Il ne vous reste plus qu'à faire glisser les fichiers en vous assurant que votre fichier <b>index.php<\/b> est le premier fichier du dossier <b>public-html<\/b> comme la figure suivante le montre :\n<\/p>\n<img  src=\"img\/res\/filezilla1.PNG\">","lvl":"confirme","published":"true","id":"1497209627"}