{"title":"Les images #3","content":"<p>\n    Vous savez comment rajouter des images toutes simples dans le code html en utilisant la balise &lt;img src=\"#\"&gt;. Saviez vous qu'on pouvais aussi le faire, juste avec du CSS ?\n<\/p>\n\n<h4>Les images en arrière plan<\/h4>\n\n<p>\n    Cependant, déclarer une image comme nous venons de le voir n'est pas très pratique dans certains cas. On peut juste modifier la taille de l'image. Graçe aux dernières propriétés CSS, on peut déclarer une image en arrière plan, exactement comme pour les couleurs de fond. C'est très pratique si l'on a qu'une seule image à mettre !\n<\/p>\n\n<textarea>    \nbackground-image: url(...);\n\/*Remplacez les trois petits points par le nom de votre fichier*\/\n<\/textarea>\n\n<p>N'oubliez pas de mettre l'extension ! De plus, il est préférable que le nom de votre image ne comporte pas d'espaces.<\/p>\n<b>Exemple: \"mon_image.jpg\" ou \"monImage.jpg\" sont préférables à \"mon image.jpg\"<\/b>\n\n<hr>\n<h5>Hauteur minimum<\/h5>\n<p>\n    Cependant, si vous ne rajoutez rien, l'image ne s'affichera pas. Elle n'a en effet pas de hauteur car son conteneur (une div, un header...) n'en a pas par défaut. Nous allons donc devoir rajouter une hauteur minimum !\n<\/p>\n\n<textarea>\nbackground-image: url(...);\nmin-height: ...px;\n\/*OU*\/\nmin-height:...vh;\n<\/textarea>\n\n<p>\n    Comme vous le voyez, vous pouvez soit utilisez les pixels soit une unité mystérieuse nommée \"vh\".VH veut tout simlement dire \"viewport-height\", hauteur de l'écran en français. Si vous mettez 100vh, votre image occupera toute la hauteur de l'écran (si elle est assez grande).Si vous mettez 50vh, votre image occupera la moitié de l'écran. Si vous mettez 200vh, votre image occupera deux fois la taille de l'écran en hauteur (vous devrez descendre dans la page).\n<\/p>\n<h5>Ajustement à la taille de l'écran<\/h5>\n<textarea>\nbackground-image: url(...);\nmin-height:...vh;\nbackground-size:cover;\n<\/textarea>\n<p>\n    <i>Background-size:cover;<\/i> permet de forcer l'image à occuper toute la largeur de l'écran. On l'utilise très souvent. Si vous avez une grande photo et que vous n'utilisez pas cette règle, vous aurez un gros plan sur une partie de l'image.\n<\/p>\n\n<h5>Répéter ou ne pas répéter...<\/h5>\n<textarea>\n    \n    background-image: url(...);\n    min-height:...vh;\n    background-size:cover;\n    background-repeat: repeat;\n    \/*OU*\/\n    background-repeat: no-repeat;\n<\/textarea>\n<p>Dans le cas où votre image serait trop petite, vous pouvez soit la faire se répéter, soit ne rien faire.<\/p>\n<hr>\n<h4>Propriété spéciale<\/h4>\n\n<textarea>\nbackground-color: white;\n\/*OU*\/\nbackground-color: #424242;\n\/*OU*\/\nbackground-color: rgba(0,0,0,0.5);\n<\/textarea>\n<p>La règle \"background-color\" permet de définir une couleur d'arrière plan. Vous avez trois moyens de déclarer votre couleur :<\/p>\n<ul>\n    <li>En écrivant son nom en anglais<\/li>\n    <li>En écrivant son code hexadécimal <a href=\"https:\/\/material.io\/guidelines\/style\/color.html#color-color-palette\" target=\"_blank\"> (voir ici)<\/a><\/li>\n    <li>En écrivant son code rgba(0,0,0,0.5)<\/li>\n<\/ul>\n<p>\n    La dernière déclaration est spéciale. Il s'agit en l'occurence de la couleur noire. Le 0.5 signifie que l'opacité est de 50%. Si vous le remplacez par 0.2, vous aurez une opacité de 20%, etc...\n<\/p>\n<b>Cette dernière propriété est très pratique !<\/b>\n<p>\n    En effet, si nous plaçons un écran transparent mais sombre devant une photo, cette dernière sera assombrie. C'est la même chose en CSS ! Il suffit pour cela de rajouter le code :\n<\/p>\n\n<textarea>\nbackground-color: rgba(0,0,0,0.5);\nbackground-blend-mode:darken;\n<\/textarea>\n\n<i>NB: \"blend-mode\" signifie qu'on mixe les couleurs et qu'on ne retient que les couleurs les plus sombres !<\/i>","lvl":"confirme","published":"true","id":"1497209681"}