{"title":"La balise <div>","content":"<h4>La balise div<\/h4>\n\n<p>\n    Il existe les balises qui ont déjà des règles CSS associées comme les balises de titre (h1,h2...), les balises b et i, la balise p, et puis il existe une (ou plutôt deux mais j'y reviendrais) balise qui ne possède rien de tout cela. C'est une boîte vide. Elle possède une seule règle CSS : \"display: block\" qui lui fait prendre la largeur de la page web.\n<\/p>\n<p>\n    Pourtant, si vous regardez le code des pages web, vous verrez que la plupart utilisent cette fameuse balise. En fait, elle peut remplacer toutes les balises contenues dans le body. Cependant, je ne conseille pas d'en faire cette usage et de la réserver pour les cas spéciaux.\n<\/p>\n\n<h4>Les étiquettes (id et class)<\/h4>\n\n<p>\n    Quand on voit des balises div, on remarque qu'elles sont souvent associées avec des id=\"...\" ou class=\"...\". Si l'on voit la structure d'une page web comme une bibliothèque, les balises forment des boites. Or, si l'on veut cibler une seule de ces boites avec le CSS, il faut pouvoir la différencier. Comment différencier deux balise p ? C'est impossible.\n<\/p>\n\n<b>C'est pour cela que les étiquettes existes.<\/b><br><br>\n\n<h5>Les id<\/h5>\n\n<textarea>\n<!DOCTYPE html>\n<html>\n    <head>\n        <style>\n            #etiquette1{\n                color: blue;\n            }\n        <\/style>\n    <\/head>\n    <body>\n        <p id=\"etiquette1\">\n            Iis ut relinqueret se tamen aliquip se consequat, quibusdam quem elit ad quae in \n            nam quo ipsum varias tamen, sint cohaerescant pariatur sunt consequat non nisi \n            cernantur illustriora ab in incididunt te consequat ad a minim labore velit \n            officia. De non veniam amet labore ne malis mandaremus ita minim quorum.\n        <\/p>\n        <p>\n            Aut quae expetendis ullamco, duis ingeniis nam praetermissum e qui arbitror do \n            quibusdam, ita probant exercitation. Do elit lorem nam commodo, elit possumus ut \n            distinguantur, lorem ab excepteur, iudicem ex singulis.\n        <\/p>\n    <\/body>\n<\/html>\n<\/textarea>\n<img src=\"img\/res\/div_0.PNG\" class=\"small\">\n<p>Ainsi, on peut ajouter à toutes les balises usuellement contenues dans le body des étiquettes. Il suffit de rajouter à l'intérieure de la balise id=\"le-nom-de-votre-etiquette\" sans accent ni espace (les majuscules sont autorisées). Et dans le CSS, au lieu d'écrire le nom de la balise (p dans l'exemple), on met le nom de l'étiquette précédé du signe dièse #.<\/p>\n<b>Attention toutefois : vous ne pouvez pas utiliser plusieurs fois la même étiquette dans le body. Vous devez changer de nom et écrire un nouveau jeu de règles CSS. Ce problème est résolu avec les class.<\/b>\n\n<h5>Les class<\/h5>\n\n<p>Le fonctionnement des class et des id est identique, à quelques différences près :<\/p>\n\n<textarea>\n<!DOCTYPE html>\n<html>\n    <head>\n        <style>\n            .etiquette1{\n                color: blue;\n            }\n        <\/style>\n    <\/head>\n    <body>\n        <h1 class=\"etiquette1\">Mon titre<\/h1>\n        <p class=\"etiquette1\">\n            Iis ut relinqueret se tamen aliquip se consequat, quibusdam quem elit ad quae in \n            nam quo ipsum varias tamen, sint cohaerescant pariatur sunt consequat non nisi \n            cernantur illustriora ab in incididunt te consequat ad a minim labore velit \n            officia. De non veniam amet labore ne malis mandaremus ita minim quorum.\n        <\/p>\n        <p>\n            Aut quae expetendis ullamco, duis ingeniis nam praetermissum e qui arbitror do \n            quibusdam, ita probant exercitation. Do elit lorem nam commodo, elit possumus ut \n            distinguantur, lorem ab excepteur, iudicem ex singulis.\n        <\/p>\n    <\/body>\n<\/html>\n<\/textarea>\n<img src=\"img\/res\/class_0.PNG\" class=\"small\">\n<b>Comme vous pouvez le voir, j'ai utilisé plusieurs fois la class dans le body sur deux balises complètement différentes. Un autre point important est que dans le CSS, je n'utilise plus le dièse # mais le point . avant le nom de l'étiquette.<\/b>","lvl":"intermediaire","published":"true","id":"1497209032"}