{"title":"Débuter","content":"<h4>Quels logiciels installer ?<\/h4>\n\n<p>\n    La bonne nouvelle, c'est que du simple texte peut faire office de page web. La mauvaise nouvelle, c'est que pour améliorer le résultat, il faut faire appel à des \"balises\". Ces balises ressemblent à cela :\n<\/p>\n\n<textarea>\n<h1>contenu de la balise<\/h1>\n\n<p>contenu de la balise<\/p>\n<\/textarea>\n\n<p>\n    A priori, ce n'est pas très compliqué ! On pourrait alors se servir du bloc note de Windows pour créer ses sites. Cependant, même si certaines personnes le font, il est conseillé d'utiliser un éditeur de texte dédié, à l'instar de <a href=\"http:\/\/brackets.io\/\" target=\"_blank\">Brackets<\/a>, <a href=\"https:\/\/notepad-plus-plus.org\/fr\/\" target=\"_blank\">Notepad++<\/a> ou <a href=\"https:\/\/atom.io\/\" target=\"_blank\">Atom<\/a>.\n<\/p>\n\n<h5>Lequel choisir ?<\/h5>\n\n<p>\n    C'est à votre discrétion ! J'utilise pour ma part Brackets car je suis à l'aise avec. Si vous trouvez un éditeur et que vous le trouvez comfortable, choisissez le !\n<\/p>\n\n<h5>Qu'est ce qui fait un bon éditeur ?<\/h5>\n\n<p>\n    Pour créer un site web, vous allez l'utiliser intensivement ! Certaines fonctions sont particulièrement appréciées par les développeurs web :\n    <ul>\n        <li>un mode \"sombre\" pour reposer les yeux<\/li>\n        <li>une coloraton syntaxique<\/li>\n        <li>une autocomplétion des balises... le pied !<\/li>\n        <li>une sauvegarde automatique<\/li>\n        <li>...<\/li>\n    <\/ul>\n<\/p>\n\n<hr>\n\n<h4>Le navigateur est votre ami !<\/h4>\n\n<p>\n    On pourrait penser que le navigateur ne sert qu'a afficher les pages webs... Il sert aussi à trouver vos erreurs ! Voici comment faire ;-)\n<\/p>\n\n<p>\n    Ouvrez votre page web avec votre navigateur, puis faites un clic droit et sélectionnez \"examiner l'élément\" sous Firefox ou \"inspecter\" sous Chrome. Puis trouvez l'onglet console.\n<\/p>\n<br>\n<img src=\"img\/res\/erreurcss_0.PNG\">\n<p>L'onglet console vous indique les erreurs dans le CSS (et aussi dans d'autre languages !)<\/p>\n<br>\n<img src=\"img\/res\/erreurcss.PNG\">\n<p>\n    Ici, j'ai volontairement fait une faute dans la règle CSS appliquée à la balise body. La console m'indique que je dois :\n\n<ul>\n    <li>Remplacer le \"=\" par \":\"<\/li>\n    <li>Fermer la règle body par \"}\"<\/li>\n<\/ul>\n<\/p>\n<h5>Regarder le code d'autre sites web<\/h5>\n\n<p>\n    Vous êtes curieux de savoir comment tel ou tel site est fait ? Vous pouvez jeter un oeil au code ! Voici une liste des langages que vous verrez :\n    \n<ul>\n    <li>HTML<\/li>\n    <li>CSS<\/li>\n    <li>JavaScript \/ jQuery \/ ...<\/li>\n<\/ul>\n\n<p>\n    Ne prenez pas peur, la plupart des sites que vous verrez sur internet ont étés créés par des développeurs chevronnés avec plusieurs années d'expérience !\n<\/p>\n<img src=\"img\/res\/codesource_0.PNG\">","lvl":"debutant","published":"true","id":"1497209008"}