{"title":"Qu'est ce que c'est ?","content":"<p>\n    Avant de nous lancer, voici quelques rappels de base.\n    <br>\n    Quand on va sur internet, on utilise un navigateur internet et on visite des sites web qui sont constitués d'une ou plusieurs pages web. Sur ces pages, on peut trouver du texte, des images, des vidéos, bref du contenu. Or, il est très facile de créer ces \"pages web\" !\n<\/p>\n\n<h4>Quel est le lien avec le HTML ?<\/h4>\n\n<p>\n    Le HTML ou HyperText Markup Language dans la langue de Shakespear est une sorte de langage permettant de créer des pages web et donc des sites web. Le terme de HTML peut faire peur mais il signifie tout simplement que l'on va utiliser des boites (appelées balises) pour structurer le contenu des pages. En effet, comment faire pour afficher le titre en haut, au milieu et en rouge sans que le reste soit affecté ? Il suffit d'utiliser des boites !\n<\/p>\n\n<h5>Et les navigateurs dans l'histoire ?<\/h5>\n\n<p>\n    On utilise quotidiennement les navigateurs : Firefox, Chrome, Opéra, Safari...<br>\n    Je vous rassure tout de suite, pour créer des pages web, il n'y a pas besoin de savoir comment fonctionne les navigateurs ! Cependant, il est bon de connaitre le fonctionnement global.\n<\/p>\n<p>\n    Un navigateur va lire le code que vous avez écris sur votre page web et l'afficher sur votre écran. Cette page à été lue de haut en bas et de gauche à droite par votre navigateur qui a automatiquement ajouté les couleurs et centré les éléments.\n<\/p>\n<p>\n    <b>Et c'est le fin mot de l'histoire : \"créer\" un site web revient simplement à donner des consignes d'affichage au navigateur.<\/b>\n<\/p>\n\n<hr>\n\n<h4>L'univers du dévelopement web<\/h4>\n\n<p>\n    Pour être honnête, il existe beaucoup, beaucoup de langages pour créer des sites web. La bonne nouvelle, c'est que pour débuter, vous n'aurez besoin que d'un seul : le HTML. Cependant, vous allez vite vouloir personnaliser d'avantage votre site web et vous allez alors vous intéresser à un autre langage, fort heureusement très proche du HTML : le CSS.\n<\/p>\n\n<h5>Le CSS<\/h5>\n\n<p>\n    Le CSS est un langage qui sert à styliser le contenu que vous avez écrit en HTML. Pour faire une représentation schématique, le HTML représente le squelette de votre site web qui est une page blanche sans lui. Mais il n'est pas tès esthétique (du moins, il l'a été dans les années 90 !). Nous reviendrons bien sûr au CSS dans les cours de niveau intermédiaire.\n<\/p>\n\n<hr>\n\n<h4>Rendre son site accessible à tout le monde<\/h4>\n\n<p>\n    J'ai décidé d'inclure ce petit paragraphe ici pour que vous ayez une idée de l'objectif final. En effet, Internet a à la base été construit pour partager des informations. Son objectif est toujours le même ! Votre objectif final est donc que d'autre personnes puissent accéder à votre site web et y trouver des informations.\n<\/p>\n\n<p>\n    Cependant, je vous rassure tout de suite : personne ne peut y accéder si vous n'avez pas \"hébergé\" votre site !\n<\/p>\n\n    \n<h5>Héberger son site<\/h5>\n\n<p>\n    Quand vous aurez commencé à créer des pages web, vous vous rendrez à l'évidence : pour que vous puissiez y accéder, votre ordinateur doit être allumé ! Si vous voulez que tout le monde puisse y accéder, vous devez mettre votre site sur un ordinateur allumé en permanence. Ce genre d'ordinateur s'appelle un serveur.\n<\/p>\n<p>\n    Ces serveurs sont détenus par des compagnies privées qui les louents ou les prêtent. Vous importez ensuites les pages web qui constituent votre site sur ces serveurs pour que votre site devienne accessible. Nous reviendrons sur la mise en ligne d'un site dans le tout dernier chapitre malgré le fait que ce ne soit pas très compliqué ;-)\n<\/p>","lvl":"debutant","published":"true","id":"1497208994"}