{"title":"Le CSS #1","content":"<h4>A quoi sert le CSS ?<\/h4>\n\n<p>\n    Le CSS, acronyme de Cascading Style Sheets (feuilles de style en cascade en bon français) est un langage complémentaire au HTML. En effet, ce sont les deux langages de base sur internet. Il existe un consensus et tous les navigateurs l'ont accepté. C'est ainsi que tous les sites ont deux langages en commun.\n<\/p>\n<i>Les choses se compliquent quand il s'agit de dynamiser les sites web : Il existe le Javascript et son \"dialect\", le jQuery ; puis des langages comme le PHP ou le Ruby On Rails qui remplissent des usages un peu différents... Et c'est sans compter les bases de données !<\/i>\n\n<p>Le CSS sert à modéliser, à habiller le squelette écrit en HTML. Avec le CSS, vous pouvez rajouter des couleurs, des formes, des images (eh oui !), créer des effets au survol de la souris...<\/p>\n\n<h4>Comment faire ?<\/h4>\n\n<p>Il existe deux ou trois grands moyens pour \"joindre\" le CSS et le HTML. Le plus simple consiste à utiliser les balises &lt;style&gt; comme sur le code suivant :<\/p>\n\n<span class=\"line\"><\/span>\n\n<h4>Le CSS interne<\/h4>\n\n<textarea>\n<!DOCTYPE html>\n<html>\n    <head>\n        <style>\n            h1{\n                color: red;\n            }\n            h4{\n                color: pink;\n            }\n            p{\n                color: #424242\n            }\n        <\/style>\n    <\/head>\n\n    <body>\n\n        <h1>Un titre principal<\/h1>\n\n        <h4>Un titre secondaire<\/h4>\n\n        <p>Du contenu...<\/p>\n\n        <h4>Un titre secondaire<\/h4>\n\n        <p>Du contenu....<\/p>\n    <\/body>\n<\/html>\n<\/textarea>\n\n<p>Le résultat est :<\/p>\n\n<img src=\"img\/res\/css_0.PNG\">\n\n<p>Comme vous avez pu le constater, les règles CSS sont toutes écrites de la même façon : le nom de la balise suivit de \"{\".<\/p>\n<p>Les règles CSS, dans l'exemple \"color: red\"; \"color:pink\" et \"color: #424242\" possèdent également toutes la même syntaxe : le nom de la règle, deux points, la propriété et un point virgule.<\/p>\n<p>NB : On peut mettre autant de règles CSS que l'on veut !<\/p>\n<br>\n<p>Le navigateur lit les règles CSS et applique les propriétés à toutes les balises correspondantes.<\/p>\n\n<span class=\"line\"><\/span>\n\n<h4>Le CSS externe<\/h4>\n\n<p>La méthode présentée au dessus est bonne mais elle présente deux principaux problèmes : d'une page à l'autre de votre site, vous devez recopier encore et encore les mêmes règles (redondance et difficulté si vous voulez changer massivement la couleur du texte id est) et votre code risque de vite devenir fouillis...<\/p>\n<b>Le CSS externe est à plébisciter si vous risquez de vous retrouver dans ce genre de situation. Cependant, pas d'inquiétude : avec un simple copier-coller, on peut passer de l'un à l'autre.<\/b>\n\n<h5>Exemple de CSS externe<\/h5>\n\n<img src=\"img\/res\/css_1.PNG\">\n<br>\n<p>Ici, j'ai créé un fichier \"style.css\" de la même façon que mon fichier \"index.html\".<\/p>\n<br>\n<img src=\"img\/res\/css_2.PNG\" class=\"small\">\n<br>\n<p>Comme vous pouvez le constater, j'ai remplacé, dans la balise head, les balises style par la balise link. Voici la syntaxe :<\/p>\n<br>\n<textarea>\n<link href=\"nom-du-fichier.css\" rel=\"stylesheet\">\n<\/textarea>\n<p>Vous pouvez bien évidemment mettre le fichier \"style.css\" dans un dossier nommé \"CSS\" et la syntaxe deviendra:<\/p>\n<textarea>\n<link href=\"CSS\/nom-du-fichier.css\" rel=\"stylesheet\">\n<\/textarea>","lvl":"intermediaire","published":"true","id":"1497208889"}