{"title":"L'argumentation","ID":"argumentation","content":"<p>\n    Le but d’un discours argumentatif est d’amener l’autre à adhérer à une thèse appartenant à un thème donné. L’argumentation portée par la thèse va répondre à un questionnement, à une problématique. Argumenter consiste donc à soutenir ou à réfuter une opinion. Il existe trois verbes argumentatifs : convaincre, persuader et délibérer.\n<\/p>\n\n<p>\n    Convaincre quelqu’un, c’est faire appel à sa raison, à ses facultés d’analyses, à son esprit critique pour l’amener à adopter un certain point de vue. Pour cela, on va employer des arguments, étayés par des exemples et reliés entre eux par des connecteurs logiques. Les arguments sont présentés selon un plan logique dans le cadre d’un raisonnement. Il existe plusieurs types de raisonnement : le raisonnement inductif part du cas particulier pour arriver à une généralité ; le raisonnement déductif part du cas général pour arriver au cas particulier ; le raisonnement critique va réfuter la thèse opposée ; le raisonnement dialectique va peser les arguments favorables et défavorables à une thèse ; le raisonnement concessif va consister à admettre une partie des arguments de la thèse opposée pour leur opposer ensuite des arguments de la thèse défendue ; le raisonnement par analogie va rapprocher l’une des thèses à une situation comparable (on peut discuter la pertinence de la situation) ; enfin, le raisonnement par l’absurde montre que la thèse opposée aboutie à une conclusion fausse ou absurde.\n<\/p>\n\n<p>\n    Délibérer consiste à examiner les différents aspects d’une situation afin d’aboutir à la conclusion la plus impartiale qui soit : la justice délibère. C’est une composante fondamentale à la liberté et à la démocratie. Il s’agit là de se confronter à ses propres opinions ou à celle des autres afin de faire émerger une sorte de vérité suprême. La délibération est également un processus cognitif aboutissant à un choix personnel. On retrouve dans cette stratégie argumentative l’essai, le dialogue et l’apologue.\n<\/p>\n\n<p>\n    Persuader quelqu’un, c’est faire appel à ses sentiments, à ses émotions pour l’amener à adopter un certain point de vue. Pour cela, il va s’agir pour le locuteur d’utiliser les mêmes valeurs (patriotisme, honnêteté, charité…) et les mêmes références culturelles (connotations, jeux de mots, allusions…) que son destinataire. Ces références culturelles communes visent à établir un climat de confiance, mais aussi de complicité. Le discours se fait impressif et expressif : il s’agit d’agir émotionnellement sur le destinataire, de provoquer en lui des émotions qui vont l’amener à adopter le point de vue du locuteur. Il est courant d’impliquer le lecteur en s’adressant à lui par des « tu » ou « vous », de poser des questions rhétoriques en vue de créer un processus d’identification. Toujours dans ce but, on trouve fréquemment des verbes modaux (pouvoir, vouloir, devoir…), des registres pathétiques ou tragiques afin de susciter la pitié, l’indignation ou l’enthousiasme du lecteur. Cette forme argumentative est celle qui se rapproche le plus de la manipulation, en jouant sur des peurs ataviques ou des stéréotypes.\n<\/p>\n\n\n<h4>Les types d’arguments<\/h4>\n<p>\n    Toute thèse défendue est appuyée par des arguments. Un argument est une preuve destinée à appuyer une affirmation. Il existe différents types d’arguments. L’argument d’autorité fait référence à une affirmation incontestable d’un point de vue moral ou scientifique. L’analogie permet un rapprochement entre deux faits afin de faire émerger des similitudes. L’argument ad hominem est dirigé directement contre la personne défendant la thèse opposée ; il s’en prend à elle en lui opposant ses propres actes. La généralisation permet de partir d’un ou deux exemples puis d’en déduire une vérité universelle. L’ironie est une argumentation par l’absurde où il faut comprendre l’inverse de ce que dit l’auteur. On trouve des procédés tels que le portrait cynique : « Le sucre serait trop cher si on ne faisait pas travailler la plante qui le produit par des esclaves », l’antiphrase : « quel talent ! », et enfin la logique de l’absurde : « Les nègres ont le nez si aplati qu’il est impossible de les plaindre ».\n<\/p>\n\n\n\n<h4>Argumentation directe<\/h4>\n<p>\n    L’argumentation directe ou explicite regroupe des types de textes où l’auteur s’implique personnellement et où son point de vue est aisément perceptible. On retrouve dans cette catégorie l’essai : il s’agit d’un texte traitant d’un domaine précis (histoire, politique, économie…) selon le point de vue de l’auteur ; des concessions peuvent cependant faites aux thèses adverses. Les registres polémiques et didactiques sont les plus usités. Le dialogue d’idée est un moyen de confronter les arguments de deux parties. Il s’agit d’une confrontation polyphonique d’idées mais aussi de valeurs. Il se subdivise en trois grands genres. Le dialogue didactique se base sur le rapport maitre\/élève et la transmission des connaissances. Le dialogue dialectique se sert de la confrontation des idées pour construire une solution à un problème. Le dialogue polémique met en scène des personnes en désaccord sur un point. La correspondance enfin, permet d’exposer un échange d’idées ou bien, comme dans les lettres ouvertes, une forme commode pour exposer une argumentation polémique.\n<\/p>\n\n\n\n<h4>Argumentation indirecte<\/h4>\n<p>\n    Dans le cas où le point de vue de l’auteur n’est pas perceptible, on parle d’argumentation indirecte ou implicite. C’est le récit qui, au travers d’une fiction, se charge de transmettre l’argumentation. Ainsi, l’apologue est un récit court et plaisant, argumentatif et didactique qui illustre une morale. Entre la fiction et la réalité se tisse une métaphore filée. On retrouve ce principe dans les fables (par exemple, les fables de Jean La Fontaine mettant en scène des animaux à caractère anthropomorphique), mais également dans les paraboles bibliques, telle que l’illustre celle du figuier stérile. Se dessine alors une figure d’analogie entre le figuier et l’Homme qui invite implicitement à s’interroger sur le rôle et la valeur de chaque humain sur Terre (lien entre vie et utilité). La différence majeure entre la fable et l’apologue vient de la véracité de ce dernier. Voltaire dira « J’aime les fables des philosophes, je ris de celles des enfants, je hais celles des imposteurs ». Sont aussi regroupés sous le terme d’apologue le conte, récit imaginaire à but didactique et ses variantes : le conte philosophique (Candide, Zadig) qui est un récit d’apprentissage où les personnages sont peu caractérisés afin de susciter une large identification du public. L’exemplum est un récit bref dont le but est de donner un modèle de comportement ou de moral en se basant (dans le cas des exempla latins) sur l’Ancien Testament, les auteurs de l’Antiquité et les récits traditionnels. Cette forme d’argumentation a été fortement utilisée par les prédicateurs. L’utopie met quant à elle en scène un univers parallèle au notre, reprenant et réécrivant les règles de société afin d’atteindre un idéal. Cela soulève bien souvent la question de l’universalité de l’idéal, comme dans le passage de Candide, l’Eldorado. De plus, les lieux utopiques sont bien souvent clos et inaccessibles, rappelant ainsi l’échec d’une telle pensée. La dystopie ou contre-utopie est le penchant noir de l’utopie. Popularisé par Georges Orwell (1984) au vingtième siècle, il exprime la crainte de l’Homme, au lendemain des guerres mondiales, face aux totalitarismes planétaires.\n<\/p>","tags":["français","argumentation"],"date":"17\/08\/2019 - 11:11","is-draft":true}