{"title":"Brève histoire du progrès social","ID":"breve-histoire-progres-social","content":"<p>Débutée en Angleterre à la fin du\r\ndix-huitième\r\nsiècle avec l’apparition de la machine à vapeur de\r\nWatt, la révolution industrielle va s’étendre aux pays\r\nvoisins avant de s’exporter outre atlantique. Elle est responsable\r\nd’un changement considérable dans la manière de\r\nproduire et de consommer : d’un artisanat servi par la force des\r\nhommes on évolue vers une ère industrielle où les\r\nmachines permettent d’accélérer la production de biens\r\nmanufacturés. Cette production de masse nécessite\r\nd’avoir une main d’œuvre disponible à\r\nproximité d’où la création des cités\r\nouvrières. En effet, cette augmentation de la production par la\r\nrationalisation du travail fait chuter les prix et nombre d’artisans\r\nisolés ne peuvent soutenir la concurrence. Les bouleversements\r\nsociaux et économiques sont importants, la migration de familles\r\nentières conduit à une modification de l’urbanisme :\r\nétalement urbain, densification. Les conditions de vies sont\r\néprouvantes du fait de logements insalubres. Ce thème sera\r\nrelayé au dix-neuvième siècle par les\r\nécrivains\r\nnaturalistes comme Emile Zola (Germinal), Victor Hugo (Contemplations)\r\nmais\r\nsurtout Charles Dickens dont les œuvres (Oliver Twist, De Grandes\r\nEspérances) seront nourries par une enfance difficile. Tous les\r\nmembres de la famille travaillent, de la mère de famille aux\r\nenfants, même très jeunes. Le travail des enfants est un\r\naspect emblématique des combats pour le progrès social : ce\r\nsont les personnes les plus fragiles et les plus facilement exploitables.\r\nPeu après cette première révolution industrielle\r\naxée sur l’exploitation des mines de houille et son\r\napplication dans la machine à vapeur et donc dans le chemin de fer,\r\nsurvient dans la deuxième moitié du dix-neuvième\r\nsiècle une seconde révolution profitant de la\r\ndécouverte de l’électricité et du\r\npétrole. Cette époque sera également marquée\r\npar une capitalisation accrue des sociétés : les patrons\r\nrecherchent des investisseurs et les entreprises se titrisent pour\r\naugmenter leurs capitaux. Le cercle pourrait d’un premier abord\r\nparaître vertueux, mais si aujourd’hui un peu moins des\r\ndeux-tiers de la richesse produite vont aux salariés, il n’en\r\nétait pas de même à l’époque. Apportons\r\nune précision sur ces chiffres. La richesse produite correspond\r\nà la valeur ajoutée par l’entreprise pour un produit\r\nou\r\nun service. Cette valeur ajoutée correspond elle-même\r\nà\r\nla production diminuée des coûts intermédiaires. Le\r\ncumul des valeurs ajoutées de toutes les entreprises forme le PIB.\r\nOr, en France, si les premières réflexions sur cet indice\r\nqui\r\npermettront sa mise en place dans le futur commencent à la fin du\r\ndix-huitième siècle, les séries de comptes permettant\r\nde mesurer la croissance de l’activité économique,\r\nelles, ne débutent qu’en 1949. Ainsi, pour des années\r\nantérieures à 1949 seront utilisés les travaux\r\nd’Angus Maddison. Ce sont certes des chiffres à posteriori et\r\ndonc potentiellement tronqués (du fait du manque de\r\nprécisions des données) mais avec toute\r\nl’objectivité d’un recul tri centenaire.\r\n<\/p>\r\n\r\n<h3>L’injustice Française (1800 –\r\n1850)<\/h3>\r\n\r\n<p>Profitant d’une opacité juridique et d’une\r\npériode politiquement instable (entre 1800 et 1850, se\r\nsuccèderons un empire et trois monarchies), les dirigeants et\r\nactionnaires de ces sociétés du secteur primaire et\r\nsecondaire ne vont assurer qu’un faible développement des\r\nconditions de vies de leurs salariés, encouragés par\r\nl’établissement par l’état d’un pacte de\r\nnon intervention dans la relation patron - ouvrier au nom de la\r\nliberté économique. De plus, le Premier Empire loin de\r\nfavoriser les ouvriers inscrira dans le code pénal le délit\r\nde grève en prévoyant des peines de prison pour les\r\ncontrevenants. La seule avancée positive réalisée\r\ndurant cette période est la création d’un conseil de\r\nprud’hommes, à Lyon, en 1806. L’interdiction des\r\nsyndicats et un paternalisme patronal important ferme toutes\r\npossibilités d’évolution pour les ouvriers. Par\r\nailleurs, les contestations salariales sont violemment\r\nréprimées par les forces de l’ordre en France,\r\nGrande-Bretagne, Allemagne : révolte des Canuts en 1831,\r\njournées de juin 1848… La plus grande particularité\r\ndu\r\nsyndicalisme français va être une forte politisation et une\r\nnaissance violente – tous les évènements cités\r\nplus hauts se solderont par de nombreuses morts, environ trois cent pour\r\nla\r\nrévolte des Canuts.<\/p>\r\n\r\n<h3>Développement du progrès social<\/h3>\r\n\r\n<p>Avant d’aller plus loin, arrêtons-nous sur le concept\r\nde\r\nprogrès social. Ce dernier peut paraitre très vague au\r\nregard\r\nde la pléthore de notions englobées. D’une\r\nmanière tranchée, il serait possible de prendre la\r\nRévolution française comme charnière du\r\nprogrès\r\nsocial ; la mesure est à nuancer. En effet, si la DDHC marque un\r\ntournant en édictant des droits justes, diverses mesures prises\r\ndans\r\nles années suivantes comme la loi Le Chapelier ou le décret\r\nD’Allarde écartent l’idée de Montesquieu de\r\n« corps intermédiaires », à savoir les\r\nsyndicats.\r\nDe plus, ces lois interdisent les grèves, les regroupements\r\nd’artisans et d’ouvriers, les corporations, sans pour autant\r\nfaire de même avec les trusts et autres associations patronales. En\r\ncela, on peut dire que bien qu’ayant été prises\r\naprès la révolution, ces lois furent injustes et\r\nréduisirent les droits des salariés tout en posant les bases\r\nd’un renouveau : ces corporations étaient devenues un\r\nobstacle\r\nà une démocratie future de par leur implication en\r\npolitique.\r\nAprès la période Charles X qui est marquée par un\r\nretour du rigorisme et s’achève lors des Trois Glorieuse, son\r\ncousin, Louis-Philippe qui monte sur le trône. C’est sous son\r\nrègne que sera promulguée la première loi encadrant\r\nle\r\ntravail, le 22 mars 1841. Près d’un demi-siècle\r\naprès le début de la première révolution\r\nindustrielle, l’état fait une entorse au principe de non\r\nintervention dans les relations ouvriers – patronat et encadre le\r\ntravail des enfants. En l’absence d’inspecteurs du travail et\r\navec des familles elles-mêmes réticentes à se voir\r\npriver d’une partie de leurs revenues, les effets de cette loi sont\r\ntout de même à mesurer. Le problème du salaire des\r\nouvriers demeure ; les mentalités doivent évoluer.<\/p>\r\n\r\n<h3>Le changement (1850 – 1884)<\/h3>\r\n\r\n<p>Le changement va s’installer à partir de la\r\ndeuxième\r\nrévolution industrielle, dans la seconde moitié du\r\ndix-huitième siècle. Bien que grèves et syndicats\r\nsoient toujours interdits, des sociétés d’entraides\r\nnaissent spontanément. Partant du principe qu’un ouvrier qui\r\nne possède que sa force de travail ne peut négocier avec son\r\npatron, le regroupement de plusieurs ouvriers permet alors d’une\r\npart\r\nde rééquilibrer la balance de la lutte des classes\r\nintrinsèque à l’entreprise et d’autre part un\r\nsoutien moral et financier aux ouvriers. L’évolution est en\r\nmarche et en 1864, la loi Ollivier abroge le délit de coalition et\r\ninstaure le droit de grève. Ce dernier est néanmoins\r\nprécaire car toute grève rompt le contrat de travail de\r\nl’ouvrier et le met potentiellement au chômage, d’autant\r\nque l’afflux dû à l’exode rural est important et\r\nqu’il est facile de remplacer un ouvrier peu qualifié par un\r\nautre. La défense des droits des ouvriers est à\r\naméliorer. Un changement décisif sera apporté par\r\nPierre Waldeck-Rousseau : en 1884, la loi éponyme autorise les\r\nsyndicats en abrogeant la loi Le Chapelier. Pourtant, en 1871, un coup\r\nterrible est porté aux milieux du syndicalisme naissant : la\r\nCommune. Si le soulèvement fut une démonstration des\r\ncapacités de rassemblement des idées, la Semaine Sanglante\r\nqui clôtura ces deux mois vit tomber nombre de têtes pensantes\r\nsocialistes, marxistes et anarchistes. C’est le début\r\nd’un siècle de contestation et de lutte.<\/p>\r\n\r\n<h3>Les revendications syndicales (1884 - 2015)<\/h3>\r\n\r\n<p>La situation politique de la France, bien qu’instable du\r\nfait\r\nd’un mode de scrutin favorisant les blocages législatifs\r\npermet une démocratie suffisante à\r\nl’épanouissement des syndicats. En 1891, la première\r\nconvention collective entre syndicats et patronat est signée suite\r\nà des grèves dans le milieu ouvrier. Deux ans à peine\r\nse sont écoulés après la loi Waldeck-Rousseau que la\r\nFédération Nationale des Syndicats (FNS) voit le jour,\r\nextrêmement politisée, empreinte de valeurs socialistes\r\n(Jules\r\nGuesde). C’est ce patrimoine qui entrainera en 1895, la disparition\r\nau profit notamment la Confédération Nationale du Travail\r\n(CGT).<\/p>\r\n\r\n<p>Les progrès sociaux, jusqu’alors très lents\r\nvont\r\ns’accélérer : le 2 novembre 1892 est votée une\r\nloi organisant les inspecteurs du travail et encadrant encore un peu plus\r\nle travail des femmes et des enfants ; le 9 avril 1898 une loi implique la\r\nresponsabilité du patron en cas d’accident d’un ouvrier\r\nsur le lieu de travail. Cette dernière mesure est remarquable car\r\nelle humanise les ouvriers qui ne sont dès lors plus « les\r\nchoses » de leurs patrons. En 1906, un repos de 24 heures\r\nconsécutives par semaine est voté, et en 1910, le code du\r\ntravail est promulgué, toujours en vigueur de nos jours\r\nréglementant et encadrant les relations entre salarié et\r\npatron. On remarque donc une accélération flagrante du\r\nrythme\r\ndes réformes après la légalisation des syndicats.\r\nMais\r\nest-ce seulement grâce à eux ? De par les contestations\r\nspectaculaires, on observe ainsi près de 3,3 millions de jours de\r\ngrève en 1970 dont plus des deux-tiers dans le secteur des mines et\r\nde l’industrie lourde, secteur dans lequel les progrès seront\r\nles plus longs à venir, mais pas seulement : les conditions\r\néconomiques jouent un rôle important dans le progrès\r\nsocial et donc dans les revendications syndicales. En effet, à\r\npartir des années 70 les conditions sociales vont se\r\ndégrader\r\nnon pas du fait d’une restriction des libertés mais du fait\r\nd’une dégradation de la situation économique qui\r\nentraine les entreprises à restreindre les avantages\r\naccordés\r\naux salariés.<\/p>\r\n\r\n<h3>En bref...<\/h3>\r\n\r\n<p>Puisant leurs racines dans les confréries du\r\nMoyen-âge (les\r\ncorporations), les syndicats sont finalement autorisés en 1884, une\r\nvingtaine d’années après le droit de grève.\r\nC’est à partir de la date de leur légalisation que les\r\nlois améliorant le travail des ouvriers se succèdent alors\r\nque les progrès étaient très lents avant la loi de\r\nWaldeck-Rousseau. C’est à partir de la seconde moitié\r\ndu 19ème siècle que les syndicats prennent leur\r\nvéritable essor sous les 1ère, 2ème et 3ème\r\nrépubliques. Ils offrent alors un contre-pouvoir unissant les\r\nsalariés contre le pouvoir absolu du patronat. Pour qu’il y\r\nait progrès social, le salaire des employés doit augmenter,\r\net donc l’équilibre entre rémunération du\r\ncapital et rémunération salariale. Là est le\r\nrôle des syndicats : un relatif équilibre de la\r\nrépartition des bénéfices de l’entreprise. Mais\r\nleur rôle ne s’arrête pas là : envers\r\nl’état sera dirigé des protestations dans le but\r\nd’obtenir des lois de protection sociale : la Sécurité\r\nSociale, la pénibilité du travail, le travail des mineurs...\r\nn’en sont que les plus emblématiques.<\/p>\r\n\r\n<p>La démocratie est la condition sine qua non\r\nd’existence des\r\nsyndicats et permet en elle-même un progrès social. De plus,\r\nce progrès social n’est pas perpétuel mais tend vers\r\nune limite : à trop revendiquer, les syndicats ont tout à y\r\nperdre, à commencer par les entreprises qui sont à la base\r\ndu\r\nprogrès social car créatrices de richesses par\r\nl’exploitation du travail humain (c’est le\r\ncapitalisme).<\/p>","tags":["histoire","sociologie","économie"],"is-draft":true,"date":"22\/06\/17 - 08:12"}