{"title":"Introduction à UNIX","ID":"breve-histoire-dunix","content":"<p>Qu'est-ce que UNIX ? Objectivement, il s'agit d'une famille de systèmes d'exploitation, regroupant aujourd'hui Mac OS et Linux. Un très célèbre système d'exploitation n'étant pas basé sur UNIX est Windows (qui est basé sur DOS).<p>\n\n<h3>Histoire<\/h3>\n\n<p>\n    Remontons à une époque où les ordinateurs étaient encore de gros monstres qui occupaient plusieurs mètres cubes, à savoir les années 60. Nous nous trouvons dans les locaux des laboratoires de Bell Industries, société américaine puissante spécialisée dans les télécommunications.\n<\/p>\n\n<p>\n    La DARPA, l'agence américaine de la recherche militaire a en effet débloqué des fonds pour créer un système d'exploitation qui serait à la fois multitâches mais également multi-utilisateurs. Les Bell Labs ne sont pas seuls sur le coup : c'est en effet à la General Electric que reviendra la tâche de construire les composants matériels - les Bell Labs étant chargés d'écrire le code source.\n<\/p>\n\n<p>\n    Le projet est baptisé MULTICS, pour Multiplexed Information and Computing Services, que l'on pourrait traduire par système de calcul et d'information multiplexé. Mais le système est lourd et très complexe à maintenir et surtout, les performances ne sont pas au rendez-vous. Finalement, les laboratoire Bell se retirent du projet en 1969. Mais cela n'empêche pas deux ingénieurs, K. Thompson et D. Ritchie de poursuivre le projet dans leur coin.\n<\/p>\n\n<img src=\"http:\/\/web.mit.edu\/Saltzer\/www\/GE645.jpg\">\n\n<p>\n    Le système naissant ne sera plus multi-utilisateurs mais mono utilisateur mais conservera le multitâche. C'est ainsi que la refonte officieuse du projet MULTICS se trouve un nom : UNICS. Si au début le système d'exploitation est écrit en langage B, inventé par Thompson, Ritchie y apporte des améliorations et bientôt, ces dernières sont tellement importantes qu'un nom est donné à ce nouveau langage : le C. Enthousiasmé par le langage de Ritchie, Thompson réécrit le code d'UNICS en C.\n<\/p>\n\n<p>\n    Le code source du projet est ensuite envoyé à différentes universités américaines et une communauté grandissante se forme : c'est le début de l'aventure UNIX. \n<\/p>","tags":["histoire","    technologie","    unix"],"date":"28\/12\/2021 - 18:54","is-draft":true}