{"title":"Chomsky et la grammaire universelle","ID":"chomsky-grammaire-universelle","content":"<p>Noam Chomsky est un linguiste et philosophe Américain\r\nné en 1928 à Philadelphie, USA. Il se marie en 1949 à\r\nCarol Chomsky, une amie d'enfance et vivent quelques temps en Israël\r\ndans un Kibboutz . Un Kibboutz est une congrégation juive peu\r\nreligieuse (d'où les conflits avec les rigoristes) de personnes\r\nsouvent d'un niveau socio-intellectuel élevé. Cette\r\ndernière poursuit des études de linguistique, \"dans le\r\ncas où son mari se serait retrouvé en prison pour ses prises\r\nde positions contre la guerre du Vietnam.<\/p>\r\n\r\n<p>\r\nIl reste célèbre pour sa théorie sur la grammaire\r\nuniverselle, selon laquelle des structures grammaticales seraient\r\nprésentes dès la naissance. Il se fonde pour appuyer cette\r\nthèse sur des exemples dont celui d'un enfant sourd, qui\r\nmalgré un mauvais apprentissage (pauvreté de l'apport) de la\r\nlangue des signes avait réussi à développer une\r\ngrammaire cohérente.<\/p>\r\n\r\n<p>\r\nCette thèse de structures grammaticales universelles\r\npréinscrites chez l'enfant provoqua dans les années 60 un\r\nbouleversement. En effet, jusqu'à cette date et depuis les\r\nlumières, la théorie communément exploitée\r\nétait que le cerveau de l'enfant était une \"tabula\r\nrasa\", une table rase, vierge de toute structure\r\npréexistante.<\/p>\r\n\r\n<p>\r\nOn peut faire un rapprochement avec la thèse platonicienne de la\r\n\"réminiscence\" selon laquelle l'âme séjourne\r\ndans le monde des idées avant d'être incarnée, elle\r\nsait tout pourrait-on dire. Au moment de son incarnation, elle boit une\r\ngoutte du fleuve Léthé (grec ancien, oubli) et oublie ce\r\nqu'elle savait. Le travail du philosophe consiste alors à\r\nréveiller ce savoir enfoui, à l'instar de Socrate posant des\r\nquestions à un jeune esclave pour l'amener à dupliquer un\r\ncarré.<\/p>\r\n\r\n<blockquote>\r\n« Pour engloutir mes sanglots apaisés<br>\r\nRien ne me vaut l'abîme de ta couche ;<br>\r\nL'oubli puissant habite sur ta bouche,<br>\r\nEt le Léthé coule dans tes baisers. »<br>\r\n<i>Baudelaire<\/i>\r\n<\/blockquote>\r\n\r\n<p>\r\nAu-delà de cette première approche, on peut se demander,\r\ncomme Platon dans le Cratyle si les mots sont liés ou non aux\r\nchoses\r\net phénomènes qu'ils représentent. Dans cette\r\nœuvre datant du Vème siècle avant JC, Socrate, le\r\nmaitre de Platon écoute et débat de deux thèses\r\nopposées, l'une soutenue par Cratyle, l'autre par\r\nHermogène.<\/p>\r\n\r\n<p>\r\nSi Cratyle soutient que les nom sont justes par nature, Hermogène\r\nsoutient quant à lui que les noms ne sont reliés aux objets\r\nqu'ils désignent que par une convention humaine. Derrière la\r\npensée de Hermogène se retrouve ce que Platon qualifie de\r\nscepticisme à savoir la pensée de Protagoras : \"l'Homme\r\nest la mesure de toute choses\". Sextus Empiricus interprétait\r\ncette formule comme un relativisme absolu, il n'y a donc que des\r\nvérités subjectives et le monde des idées et de fait\r\nimpossible car il supposerait des vérités universelles\r\n(objectives).<\/p>\r\n\r\n<p>\r\nA noter que d'autres interprétations de cette formule sont\r\npossibles\r\n: celle, élevant l'Homme en fondateur de la rationalité de\r\nla\r\nnature. Une conception plus radicale encore serait de reprendre la\r\npensée de Husserl (\"toute conscience est conscience de quelque\r\nchose\"), ce qui signifierais que sans l'Homme, rien\r\nn'existe.<\/p>\r\n\r\n<p>\r\nUn lien important est à faire avec le Théétète\r\nde Platon. En effet, après être arrivé à la\r\nconclusion que les mots suggèrent une action (mouvement, repos),\r\nc'est sur leur sens que doit porter toute interrogation et non sur les\r\nmots. Dans le Théétète, Platon démontre\r\nl'importance des Formes sans qui rien n'est possible.<\/p>","tags":["philosophie","grammaire","langage"],"is-draft":false,"date":"22\/06\/17 - 07:56"}