{"title":"L'Europe: prémices et construction","ID":"construction-europe","content":"<p>Le terme \"Europe\" nous est familier. Il est cependant\r\nutilisé pour désigner un espace géographique\r\ns'étendant depuis la pointe sud de l'Espagne jusqu'à Moscou\r\nà l'est pour une superficie totale de dix millions de\r\nkilomètres carrés. Si l'on souhaite parler de l'association\r\néconomique européenne, on utilisera plus le terme d'Union\r\nEuropéenne.<\/p>\r\n\r\n<p>Comme il s'agit bien d'une association, certains pouvoirs,\r\nappartenant\r\nd'ordinaire aux états sont délégués à\r\ndes entités supranationales. Des mesures communes sont\r\négalement prises et il faut donc un siège où prendre\r\nles décisions communes. C'est ainsi que nous allons étudier\r\nles rouages de cette machine.<\/p>\r\n\r\n<p>Tout commence après la seconde guerre mondiale. On dit\r\nsouvent\r\nqu'elle s'est terminée en 1945 - la date exacte est le 2 septembre\r\npour l'armistice. On rappelle également les différences\r\nidéologiques fondamentales existantes entre communisme (URSS \/\r\nCCCP)\r\net capitalisme (Etats-Unis, vieille Europe). Juste après la guerre,\r\nStaline va entourer l'URSS de pays satellites. C'est ainsi qu'à\r\nlieu\r\nle Coup de Prague en février 1948. Lors de cet\r\névènement, le parti politique communiste local prend le\r\ncontrôle de la Tchécoslovaquie. Ce tour de force effraie de\r\nnombreux pays capitalistes qui décident de se lier les uns aux\r\nautres dans un but défensif : c'est le traité de Bruxelles\r\n(17 mars 48). Plus tard, afin de contribuer au rétablissement des\r\néconomies respectives des anciens pays occupés, ils\r\ncréent la CECA, Communauté Européenne du Charbon et\r\nde\r\nl'Acier (1952).<\/p>\r\n\r\n<p>Cette CECA est absolument novatrice dans la mesure où elle\r\nest\r\nbasée sur des principes supranationaux, c’est-à-dire\r\nque les nations délèguent une part de leur\r\nsouverainetés à une entité supérieure. La CECA\r\na aussi permis de créer un marché unique du charbon et de\r\nl'acier à une époque où la vieille Europe\r\nétait\r\nencore industrieuse. De nos jours, nous assistons à la fin de cette\r\nindustrie - la fermeture suivie d'une délocalisation d'Arcelor\r\nMittal en est un exemple.<\/p>\r\n\r\n<p>La CECA ouvrira la voie à deux autres projets d'ampleur\r\nsupranationale : la CED (Communauté Européenne de\r\nDéfense, 1952 - 1954) et la CEE (Communauté Economique\r\nEuropéenne 1957 - 1993).<\/p>\r\n\r\n<p>La CEE est un projet \"européen\" dans la mesure\r\noù\r\nil est totalement indépendant du plan Marshall - ce plan d'aide\r\naméricain issu de la pure stratégie de\r\n\"l'endiguement\". Il marque également la voie de la\r\nréunion des différents projets supranationaux en unifiant\r\nCEE, CECA et Euratom (projet européen sur la recherche\r\nnucléaire). Il pose les jalons de l'Union\r\nEuropéenne.<\/p>\r\n\r\n<p>Mais ce qui fera vraiment basculer le \"simple\" projet\r\nqu'est la\r\nCEE au rang de monstre économique à la monnaie attractive\r\nc'est le ministre français Jacques Delors. C'est ce dernier qui\r\npoussera à la signature de l'Acte Unique Européen en 1987,\r\nélargissant ainsi le champ d'action de la CEE.<\/p>\r\n\r\n<h3>Le Traité de Maastricht<\/h3>\r\n\r\n<p>On dit souvent que le traité de Maastricht a fondé\r\nl'Union\r\nEuropéenne. Il s'agit en fait d'un traité - un contrat dans\r\nun sens international - constitutif (c’est-à-dire qu'il pose\r\nles bases politico juridiquo économiques de l'UE).<\/p>\r\n\r\n<p>Un autre traité régit quant à lui le\r\nfonctionnement de\r\nl'UE : le traité de Rome (signé en 57) et modifié par\r\nle traité de Lisbonne (2007).<\/p>\r\n\r\n<p>Ce qu'il est fondamental de comprendre dans le traité de\r\nMaastricht\r\nest qu'il met en place trois piliers, c’est-à-dire trois\r\nprincipes fondamentaux de l'UE.<\/p>\r\n\r\n<ul>\r\n    <li>Politique Economique Commune<\/li>\r\n    <li>Politique étrangère ","tags":["histoire","                 géographie"],"date":"28\/12\/2021 - 18:54","is-draft":true}