{"title":"David Hume et la conscience","ID":"david-hume-conscience","content":"<p>David Hume est un philosophe écossais du 18ème\r\nsiècle. Après s'être opposé à sa famille\r\nqui le voulait avocat, il publie quelques livres puis devient le\r\nsecrétaire particulier du Général St-Clair et parcours\r\nl'Europe mondaine. Il est ensuite secrétaire pour l'ambassadeur Lord\r\nHertford et se lie d'amitié avec Rousseau. Dix ans avant sa mort, il\r\nest sous-secrétaire d’état auprès du\r\nGénéral Conway. Il meurt en 1776.<\/p>\r\n\r\n<p>\r\nL'apport majeur de Hume à la philosophie reste l'empirisme (Cf.\r\nTraité de la nature humaine). Cette théorie qui s'oppose au\r\nrationalisme s'intéresse à la formation des idées dans\r\nnotre esprit et forme une sorte de généalogie des\r\nconnaissances. Pour les rationalistes, Descartes et Socrate en tête,\r\nseule la raison nous permet d'accéder à la connaissance.\r\nL'expérience de la nature va nécessairement corrompre cette\r\nperception. Il n'est pas de connaissance a posteriori. Hume au contraire et\r\nc'est là le sens de l'empirisme, affirme que l'expérience (et\r\ndonc le sensible) est le point de départ de toute\r\nconnaissance.<\/p>\r\n\r\n<p>\r\nPercevoir un objet extérieur implique l'utilisation des sens (vue,\r\ntoucher, ouïe, odorat). Cette perception est responsable d'une\r\nimpression (ainsi sont les sensations, émotions…) mais aussi\r\nd'une idée qui est une image affaiblie de l'impression (principe de\r\ncopie, cf. Platon et la dégradation ontologique par la copie) mais\r\nassimilée par l'esprit.\r\n<\/p>\r\n\r\n<p>\r\nToutes les opérations mentales (la pensée) s'explique par\r\nl'enchainement d'idées et de perceptions qui s'assemblent sans\r\nintervention de la volonté. Pour Hume, une question surgit alors: en\r\nquoi le moi est-il une fiction ? La majeur partie de la philosophie de la\r\nconscience est basée sur l'expérience du moi et à plus\r\nforte raison pour les rationalistes tels que Descartes pour qui la\r\npensée abouti à l'affirmation du sujet. Si je peux percevoir\r\ndes sensations, toujours différentes, je ne peux percevoir le moi,\r\nstable. En supprimant les perceptions, je n'ai plus aucune conscience de\r\nmoi, comme dans le sommeil. C'est ainsi que Hume construit la conscience\r\ndébarrassée du moi comme étant une série\r\nd'impressions diverses et variables.<\/p>\r\n\r\n<p>\r\nPour maintenir l'unité de la conscience et ainsi se reconnaitre\r\nsoi-même, Hume démontre que nos perceptions sont\r\nreliées, elles se ressemblent. Nous nous souvenons de nos\r\nperceptions passées et faisons des liens (principe de\r\ncausalité) avec nos perceptions actuelles.<\/p>\r\n\r\n<p>\r\nHume pousse néanmoins le concept plus loin : il affirme que le\r\nprincipe de causalité, qui joue une importance capitale dans les\r\nsciences et la métaphysique (par ex.  une baisse de la pression\r\natmosphérique est la cause des précipitations) n'est qu'un\r\nantécédent constant, simplement dû à\r\nl'habitude.<\/p>\r\n\r\n<p>\r\nNéanmoins, dans le livre \"L'Homme qui prenait sa femme pour un\r\nchapeau\", Oliver Sacks, neurologue Britannique du 20ème\r\nSiècle met en avant l'histoire d'un de ses patients dont la\r\nmémoire à court terme était inopérante. Le\r\npatient était ainsi incapable de se souvenir d'un\r\névènement survenu une minute auparavant : il restait\r\ncoincé à l'année 1945. Cet homme, privé de\r\npassé \"récent\" et d'avenir existait-il\r\nréellement ?  Ce paradoxe tend à illustrer les limites de la\r\nconception empiriste du Moi.<\/p>\r\n\r\n<p>\r\nLe scepticisme critique de David Hume aura de profondes\r\nrépercussions sur Kant qui le fera sortir de son \"sommeil\r\ndogmatique\".<\/p>","tags":["philosophie","conscience"],"is-draft":true,"date":"22\/06\/17 - 08:03:12"}