{"title":"Les évangiles synoptiques","ID":"evangiles-synoptiques","content":"<p>La Bible se compose de deux volets d'écrits nommés\r\n<i>testaments<\/i>. Le terme de testament vient du latin\r\n<i>testamentum<\/i> et signifie\r\ntémoignage. En distinguant religion juive et chrétienne,\r\nl'ancien testament forme les écrits antérieurs à la\r\nnativité et par la même occasion la Bible Juive. La Bible\r\nchrétienne comprend quant à elle un deuxième volet\r\nd'écritures canonisées (reconnues comme saintes) et\r\ndécrivant la vie de JC : le nouveau testament.<\/p>\r\n\r\n<p>Notons toutefois que la Bible hébraïque est plus\r\ncommunément nommée Tanakh, ce terme étant l'acronyme\r\ndes différentes parties composant cette dernière. La Torah\r\nou\r\n<i>Pentateuque<\/i> chez les chrétiens fait alors\r\nréférence\r\naux écrits de Moïse.<\/p>\r\n\r\n<p>Nous allons ici nous intéresser aux évangiles qui\r\nsont donc\r\ndes textes du deuxième volet (le nouveau testament), celui\r\ndécrivant la vie de JC dans l'exégèse\r\nchrétienne. Il existe quatre évangiles canoniques,\r\n<i>id est<\/i>\r\nreconnus par les différentes Eglises chrétiennes ; ils ont\r\nété écrits par des disciples de JC ou des proches de\r\nces derniers. Outre ces quatre évangiles, il existe d'autres textes,\r\nmais non\r\ncanonisés par l'Eglise, on les dits alors apocryphes\r\n(<i>grec<\/i>, dont\r\nl'authenticité n'est pas établie).<\/p>\r\n\r\n<p>Par l'études de ces écrits, divers\r\nexégètes\r\ndont J. Griesbach remarquent des points communs entre trois d'entre eux :\r\nce sont les textes écrits par Marc, Mathieu et Luc. Leur est alors\r\ndonné le nom d'évangiles synoptiques. Ce terme d'origine\r\ngrecque laisse entendre que ces\r\ntrois textes peuvent être mis en miroir pour être\r\ncomparés. En poussant plus avant cette théorie, des\r\nexégètes mettent en avant la possible\r\nantériorité des écrits de Marc. Cela permettrait\r\nd'expliquer le fort pourcentage de concordance entre les écrits de\r\nMarc, Luc et Mathieu. On estime même que la part unique des\r\nécrits de Marc (<i>id est<\/i> non repris par Luc et\r\nMathieu) serait de\r\nmoins de 5%. On donne le terme de sondergut (<i>allemand<\/i>,\r\n\"bien\r\npropre\") aux écrits uniques à chacun des\r\napôtres.<\/p>\r\n\r\n<p>Cette redondance entre les écrits de Marc, Luc et Mathieu\r\nfut\r\nnommée \"triple tradition\" et est la fondation de\r\nl'hypothèse d'une unique source (Marc) qui aurait inspirée\r\nLuc et Mathieu.<\/p>\r\n\r\n<p>Une deuxième théorie fût\r\ndéveloppée par\r\nl'étude des passages en commun entre Luc et Mathieu : celle des\r\ndeux\r\nsources. Il existe en effet des passages présentant un fort taux de\r\nconcordance entre Luc et Mathieu mais cependant absents de\r\nl'évangile présenté par Marc. Cela vient\r\naccréditer la théorie dite des \"deux-sources\",\r\nselon laquelle Luc et Mathieu se seraient basés et sur les travaux\r\nde Marc et sur un document postérieur à Marc dit source Q\r\n(<i>allemand quelle<\/i>, \"source\").<\/p>\r\n\r\n<p>Cependant, tous ces travaux se basent sur\r\nl'antériorité de\r\nMarc par rapport aux trois autres et sont donc à considérer\r\navec les précautions qu'il se doit.<\/p>\r\n\r\n<p>Pour terminer, j'ouvrirais cet article sur l'évangile de\r\nJean qui,\r\ndans cette théorie, se trouve être le dernier à avoir\r\nécrit son évangile. Cela ne suffit bien évidemment\r\npas\r\nà expliquer les différences en terme de style et\r\nd'engagement\r\ndes écrits (cet évangile est par ailleurs\r\nconsidéré comme étant le plus riche\r\nthéologiquement parlant).<\/p>\r\n","tags":["exégèse","  religion","  évangile"],"date":"28\/12\/2021 - 18:55","is-draft":true}