{"title":"Immunité humaine","ID":"immunite-humaine","content":"<p>La peau et les muqueuses forment une barrière naturelle contre les agressions extérieures. Il arrive cependant que cette barrière soit franchie lors, par exemple d'une lésion cutanée. C'est la raison pour laquelle avant une opération ou une simple piqure le personnel médical procède à l'asepsie de la zone cutanée concernée. D'après les travaux de Louis Pasteur, cette opération permet de stériliser de manière temporaire la zone cutanée concernée.<\/p>\r\n\r\n<p>\r\nLa surface cutanée (l'épiderme id la couche supérieure du derme) fourmille de multiples agents pathogènes tels que des bactéries ou des virus. Ceux-ci s'engouffrent dans la plaie.<\/p>\r\n\r\n<p>\r\nComment l'organisme prend t-il conscience de l'agression ? Le sentiment de douleur immédiatement consécutif à une plaie provient de la stimulation nerveuse. Il est différent du sentiment de douleur émergeant sur un terme un peu plus long, déclenché par la prostaglandine, un médiateur chimique.<\/p>\r\n\r\n<h4>Réponse immunitaire \"innée\"<\/h4>\r\n\r\n<p>\r\nDans le sang sont présentes des cellules particulières appartenant à la classe des leucocytes. On retrouve pèle mêle : mastocytes, granulocytes, phagocytes, cellules dendritiques, macrophages, natural killers. Ces cellules résident dans les tissus à l'exception des granulocytes qui se trouvent dans le sang. Elles permettent une réponse immédiate et peut se maintenir pendant 96 heures. Cette réponse immédiate est la réponse immunitaire innée. Elle est commune à tous les organisme pluricellulaire et est apparue il y a 800 millions d'années, donc bien après l'apparition de la première cellule connue (-3 Ma) mais avant l'explosion cambrienne (-300 mo) qui correspond à la colonisation terrestre et à l'émergence de la réponse immunitaire adaptative.<\/p>\r\n\r\n\r\n<h4>Détection des agents pathogènes<\/h4>\r\n\r\n<p>L'alerte est déclenchée par une des cellules déjà citées. Ces dernières disposent en effet de récepteurs PRR (Pattern Recognition Receptors ou Capteurs de Reconnaissance de Modèle) capable de reconnaitre les principaux agents pathogènes par des motifs antigéniques. L'activation d'un PRR sur un macrophage entraine la libération d'histamine (mastocytes), et de cytokine (principalement des chimiokines). L'histamine est une molécule dont la libération entraine la vasodilatation des vaisseaux sanguins. Les chimiokines attirent d'autres macrophages dans la zone concernée tandis que d'autres cytokines déclenchent la phagocytose.<\/p>\r\n\r\n<h4>Destruction des agents pathogènes<\/h4>\r\n\r\n<p>\r\nLa dilatation des vaisseaux sanguins par l'histamine va permettre à certains macrophages de franchir les parois pour aller dans l'épiderme. Le franchissement des cellules endothéliales par le leucocyte s'appelle la diapédèse.<\/p>\r\n\r\n<p>\r\nLes agents pathogènes sont \"phagocytés\" par les cellules macrophages et dendritiques (pour citer les principales). Ces dernières possèdent de nombreux replis formés par leurs cytoplasme (lui-même enfermé dans une membrane plasmique). Après avoir identifié un agent pathogène grâce aux PRR, ce dernier est emprisonné dans les replis cytoplasmiques puis dans un vacuole ou phagosome dans lequel des enzymes sécrétées par des vésicules cytoplasmiques le digèrent.<\/p>\r\n\r\n<h4>\r\nVers la réponse immunitaire adaptative<\/h4>\r\n\r\n<p>\r\nApparue il y a 400 mo, c’est-à-dire légèrement avant l'explosion cambrienne et l'émergence de vertébrés terrestres. La réponse immunitaire adaptative est déclenché au bout d'environ 48 à 96 heures. C'est les cellules dendritiques qui, après avoir sauvegardé un antigène d'un agent pathogène détruit migrent vers un ganglion lymphatique où elle \"présentent\" cet antigène aux lymphocytes.<\/p>\r\n\r\n\r\n<h4>Réponse immunitaire adaptative<\/h4>\r\n\r\n<p>\r\nLes vertébrés possèdent donc une immunité supplémentaire et spécifique. Le terme spécifique s'applique tout aussi bien au sous-embranchement du règne animal (vertébré) qu'à la réponse immunitaire en elle-même. En effet, alors que l'immunité innée est dirigée vers tous les types d'agresseurs potentiels (d'où la nécessité de différencier le soi du non soi) autant la réponse immunitaire adaptative va être dirigée contre un type d'antigène spécifique.<\/p>\r\n\r\n<p>\r\nLa réponse immunitaire adaptative est basée sur les lymphocytes, un sous-genre de leucocytes. On distingue principalement :<\/p>\r\n\r\n<ul>\r\n<li>Les Lymphocytes B<\/li>\r\n<ul>\r\n<li>Plasmocytes<\/li>\r\n<li>Lymphocytes B \"mémoire\"<\/li>\r\n<\/ul>\r\n<\/ul>\r\n\r\n<ul>\r\n<li>Les Lymphocytes T<\/li>\r\n<ul>\r\n<li>LT CD8 \"cytotoxiques\"<\/li>\r\n<li>LT CD4 \"régulateurs\"<\/li>\r\n<li>LT \"régulateurs\"<\/li>\r\n<\/ul>\r\n<\/ul>\r\n\r\n\r\n<p>Le \"T\" vient de thymus, un organe situé dans la poitrine où ce sous-genre effectue sa maturation.\r\nToutes ces cellules sont initialement formées à partir de cellules souches, dans la moelle osseuse.<\/p>\r\n\r\n<h4>\r\nLymphocytes B\r\n<\/h4>\r\n\r\n<p>\r\nIntéressons-nous d'abord aux LB. Les Plasmocytes sécrètent les anticorps. Un anticorps est une protéine poly peptique (id est composée de plusieurs peptides, il y en a 4 dans ce cas précis) en forme de Y. On distingue deux chaines \"lourdes\" et deux chaines légères. Aux deux extrémités des \"branches\" du Y se trouve une partie variable, adaptée à un type d'antigène précis tandis que l'autre extrémité est fixée au plasmocyte. Les antigènes sont quant à eux fixés sur l'agent pathogène. En cas de contact, il se produit un appairage entre le LB plasmocyte et l'agent pathogène.<\/p>\r\n\r\n<p>\r\nArrivé à ce stade, le LB plasmocyte porteur du type d'anticorps adapté va proliférer dans les tissus lors d'un processus appelé \"prolifération clonale\". A ensuite lieu la différentiation clonale des LB. Certains vont en effet se différencier en LB \"mémoire\" dont le rôle est de maintenir la mémoire du système immunitaire grâce à une durée de vie plus importante.\r\n<\/p>\r\n\r\n<p>\r\nAinsi, lors d'une vaccination, on injecte dans la plupart des cas des antigènes dont l'aspect pathogène a été désactivé ou diminué dans le but de stimuler la production d'anticorps. Il ne faut cependant pas confondre un vaccin avec un sérum qui s'obtient par centrifugation du sang dans un tube. On obtient alors un sang débarrassé de cellules, contenant seulement des protéines (et donc des anticorps).<\/p>\r\n\r\n<h4>Lymphocytes T<\/h4>\r\n<p>\r\nLes lymphocytes sont spécialisés dans la surveillance des membranes des cellules. La membrane est \"l'enveloppe\" externe, aussi appelée membrane plasmique. Cependant et contrairement aux Lymphocytes B, les LT ne peuvent reconnaitre les antigènes portés par les agents pathogènes. C'est à ce stade qu'interviennent les cellules dendritiques qui leur \"montrent\" l'agresseur.<\/p>\r\n\r\n<p>\r\nLes LT cytotoxiques (CD8) vont tuer l'agresseur de deux manières différentes. Soit en déclenchant l'apoptose de la cellule infectée (cas d'un virus par exemple), c’est-à-dire une forme de suicide ; soit par cytolyse en envoyant des protéines capable de percer la membrane plasmique. Les mitochondrie (organes internes d'une cellule) ainsi exposées cessent de fonctionner.<\/p>\r\n\r\n<p>\r\nLes LT activateurs ou auxiliaires (CD4) sécrètent une cytokine particulière, l'interleukine 2 qui stimule la prolifération des LB et des LT. Ce rôle de stimulant du système immunitaire adaptatif est diminué par les LT suppresseurs. Ceux-ci sécrètent une cytokine particulière et permettent d'empêcher une sur-activation du système. Un manque de LT suppresseurs dans l'organisme peut conduire à des pathologie auto-immunes (problème de discrimination du soi). Le virus du SIDA quant à lui va encourager l'effet suppresseur, diminuant ainsi la population des leucocytes.<\/p>","tags":["biologie","immunologie","svt"],"is-draft":true,"date":"20\/06\/17 - 13:00:24"}