{"title":"IP, subnets and a new language","ID":"ip-subnets-new-language","content":"<h3>Scheme and a month of vacations<\/h3>\n<p>\n    After nice midterms break, it's time to go back to university! I really had a nice time prepping my new semester as we are going to study a new language: scheme.\n    Scheme is an homoiconic language, it means it can interpret its own code as a piece of data in a variable.\n    There's also a LOT of parentheses. In fact, a regular function in scheme looks like this:\n<\/p>\n<pre class=\"prettyprint linenums\">\n#lang racket\n;define a function\n(define foo\n    (lambda (param1 param2)\n        (  param1 param2)))\n;call the function\n(foo 1 2)\n;outputs 3\n<\/pre>\n<p>\n    Yeah... It also use reversed polish notation, well, cause it's much more fun! In fact, polish notation is very useful as it's faster for a low specs computer to proceed to the arithmetic operation. It has something to do with the assembly language and how informatic languages are interpreted in assembly then in binary.\n<\/p>\n<p>By the way, a shorthand version for the above function is: <\/p>\n<pre class=\"prettyprint linenums\">\n#lang racket\n;define a function\n(define (foo param1 param2) (  param1 param2))\n(foo 1 2)\n;outputs 3\n<\/pre>\n<p>\n    In informatic world, it's called \"synctatic sugar\" as it makes life easier.\n<\/p>\n\n<h3>IP and networks<\/h3>\n<p>\n    This spring in university, we are going to study how networks works. It's pretty cool and I'm probably going to write a proper article about this. For now, I'm just studying the big picture and learning things on IP adresses and subnets.\n<\/p>\n\n<h4>Public and private IPs<\/h4>\n\n<img src=\"https:\/\/3.bp.blogspot.com\/-gI-ZUcRCKu8\/V3y5BR0ayII\/AAAAAAAAAU0\/QxZk_VIMFbQ6l-6B91xunwMWsRdTIR-BQCLcB\/s1600\/What is Private and Public IP Address.jpg\">\n\n<p>\n    IP stands for Internet Protocol. It's basically equivalent to you home adress, but for your computer. One tricky thing to understand is <i>public<\/i> and <i>private<\/i> adresses.\n<\/p>\n\n<p>\n    when you are at home, you are connected using your modem (what you are paying for each months). Hence, only your modem has a public adress, known from the outside internet. All your connected devices (think it as a garden) have a private adress.\n<\/p>\n\n\n<p>\n    These adresses usually starts at 127.0.0.1, which will often be the adress of your modem. If you copy and past this IP into your favorite web browser, you might be redirected to its control panel.\n<\/p>\n\n<p>\n    With a bunch of devices connected to the modem, sending data and expecting to have data back, how does the modem knows to which device send the packets ?\n<\/p>","tags":["update"," scheme"," networking"],"date":"19\/02\/2019 - 11:15","is-draft":false}