{"title":"Le Transhumanisme","ID":"le-transhumanisme","content":"<p>Le transhumanisme (abrégé en H ) est un courant de pensée\napparu au milieu du 20ème siècle et visant à\nl'amélioration par la science et la technique du genre humain.\nAinsi, \"la mort de la mort\" est un transhumanisme.<\/p>\n\n<p>Le terme de transhumanisme est composé d'un préfixe\n\"trans\", (au travers, par delà), et de la racine\nhumanisme, courant littéraire et philosophique en vogue pendant la\nRenaissance soit au 15ème et 16ème siècle. Ce dernier\nse caractérisait par une attention particulière portée\nà l'Homme, en tant que créature vivante. Le mouvement\nhumaniste se dressera par ailleurs contre le trafic des indulgences\nréalisé par l'Eglise Catholique et ses membres fourniront un\nimportant travail d'exégèse biblique.<\/p>\n\n<p>Le transhumanisme est donc un mouvement visant au dépassement de\nl'Homme dans sa nature même pour l'amener à un idéal.\nCela se retrouve déjà au 19ème siècle avec\nl'eugénisme, (litt. bien naître) de Frank Galton visant\nà la modification du patrimoine génétique humain pour\natteindre un certain idéal. Le Galtonisme est également\nemprunt d'une certaine dictature sociale étant donné que,\npour lui, les différentes classes sociales possèdent un\npatrimoine génétique adapté aux tâches incubant\nd'ordinaire à cette classe sociale et transmissible de\ngénération en génération.<\/p>\n\n<p>Le malthusianisme de Thomas Malthus est une forme d'eugénisme : en\npostulant que les besoins seront toujours supérieurs à la\nproduction, elle oblige à restreindre la population humaine comme en\nChine par exemple.<\/p>\n\n<p>Cependant, l'usage même de la technique laisse supposer le manque de\nfinitude pathologique qui caractérise l'être humain. De plus,\nle transhumanisme qui passe par la modification des structures corporelles\n- cerveau compris - pose la question de l'éthique. Un transhumain\nsera-t-il toujours humain ? Que conserver d'humain dans la transformation ?\nLes non transhumains seront-ils inférieurs ?<\/p>\n\n<p>Un des fervents opposants au transhumanisme est le philosophe et\néconomiste américain Francis Fukuyama, qui dans son livre\n\"La fin de l'Homme\" exprime son inquiétude quant au\ndevenir des systèmes politiques face au développement des\nbiotechnologies.<\/p>","tags":["philosophie"],"date":"19\/02\/2019 - 11:20","is-draft":true}