{"title":"Les opérations binaires en javascript","ID":"operations-binaires-javascript","content":"<p>\n    On explique souvent que les ordinateurs ne traitent que des 0 et des\n1.\nDes données binaires en somme, qui sont très facile à\ntraiter par un ordinateur. Quand on écrit dans un language de\nprogrammation, comme le C  , le language sert d'interface\n\"lisible\" par le programmeur, puis est ensuite compilé\npour être lisible par un ordinateur. Alors forcément, plus on\ntraite à un faible niveau (comme l'assembleur) plus on est rapide.\nD'où l'idée de manipuler les bits pour des opérations\nqui consomment beaucoup de mémoire !\n<\/p>\n<p>\n    Un language auquel on ne s'attend pas forcément dans ce\ndomaine,\nc'est un language \"web\" de haut-niveau comme le JS. Pourtant, le\nmoteur ECMA Script dans ses dernières version permet bien de\nprocéder aux opérations binaires, mais aussi au stockage de\ndonnées binaires. Nous le verrons dans la dernière partie\navec les TypedArray (tableau avec type de donnée).\n    Gardez à l'esprit que l'on peut traduire 0 par false et 1 par\ntrue.\n<\/p>\n\n<i>NB: toutes les opérations binaires décrites ici\npeuvent se vérifier sur la plupart des langages de programmation\ncourants (c  , python, java...) et également sur la calculatrice\nWindows, option \"programmeur\"<\/i>\n\n<h3>L'opérateur logique OR<\/h3>\n\n<p>\n    L'un des opérateurs les plus faciles: compare les valeurs de\nmême index, si au moins un 1 est trouvé, le résultat\nsera 1.\n<\/p>\n\n<pre class=\"prettyprint linenums\">\nconsole.log(0|1)\/\/outputs 1\nconsole.log(0|0)\/\/outputs 0\nconsole.log(1|0)\/\/outputs 1\nconsole.log(1|1)\/\/outputs 1\n\nconsole.log(111|000)\/\/outputs 111\nconsole.log(101|100)\/\/outputs 101\n\nconsole.log(1|100)\/\/outputs 101\n<\/pre>\n\n\n<h3>L'opérateur logique AND<\/h3>\n<p>\n    L'opérateur logique AND compare les valeures de même\nindex\net retourne 1 seulement si les deux valeurs sont égales à 1.\n<\/p>\n<pre class=\"prettyprint linenums\">\nconsole.log(0","tags":["informatic"," javascript"," binary"],"date":"29\/03\/2021 - 12:34","is-draft":false}