{"title":"Réflexe myotatique et curare","ID":"reflexe-myotatique","content":"<p>D'une manière concise, le réflexe myotatique est une contraction brève (et variable d'un individu à l'autre) d'un muscle, déclenché par son étirement. Mettons bien au clair qu'ici, le terme étirement est également bref. Le médecin, en frappant le tendon d'Achille provoque l'étirement du triceps sural. Le triceps sural est un muscla situé sur la face antérieur du mollet. Il est souvent très développé chez les cyclistes. Le terme \"triceps\" vient quant à lui de la conception du muscle, regroupé en trois faisceaux, c’est-à-dire trois portions indistinctes de muscles se réunissant pour en former un seul. A noter toutefois que l'on parle de chef quand on a trois portion distinctes qui se réunissent pour former le muscle.<\/p>\r\n\r\n<h4>Les muscles<\/h4>\r\n\r\n<p>D'une manière générale, on distingue chez l'être humain trois types de muscles : les muscles lisses, squelettiques et cardiaque. Si il est évident que les muscles cardiaques ne se retrouvent que dans le cœur, les muscles lisses et squelettiques nécessitent une attention plus poussée.<\/p>\r\n\r\n<p>\r\nUn muscle est constitué de cellule contractiles (capable de se contracter en coulissant les unes sur les autres, c'est comme cela que fonctionne un muscle) appelées myocytes. A l'intérieur de chaque myocyte se trouve l'actine et la myosine, des fibres contractiles. La disposition d'un muscle fait penser à celle des gros câbles que l'on trouve enfouis dans le sol. Les myocytes forment la gaine tandis que actine et myosine forme les faisceaux internes.<\/p>\r\n\r\n<p>\r\nFinalement et comme nous l'avons vu plus haut, il existe deux type principaux de cellules contractiles (les myocytes). Certaines sont  lisses tandis que d'autres sont dits squelettiques. La différence vient du contrôle du muscle.<\/p>\r\n<p>\r\nLes muscles squelettiques sont sous le contrôle du système nerveux volontaire et répondent à des influx nerveux conscients (marcher, saisir un objet). Les muscles lisses sont quant à eux sous le contrôle du système nerveux autonome (muscle de l'estomac, de la vessie).<\/p>\r\n\r\n\r\n<h4>Le contrôle des muscles<\/h4>\r\n\r\n<p>D'une manière sommaire, un muscle est relié à un neurone au niveau de la plaque motrice ou jonction neurosynaptique. L'axone du neurone transporte un courant électrique appelé potentiel d'action. Plus la fréquence de ce courant électrique est importante et plus la contraction du muscle sera importante.<\/p>\r\n\r\n<p>La commande consciente d'un muscle provient du système nerveux central, transite par les nerfs efférents (par opposition aux nerfs afférents qui transmettent un signal sensitif jusqu'au système nerveux central).<\/p>\r\n\r\n\r\n<h4>Le réflexe Myotatique<\/h4>\r\n\r\n<p>\r\nAprès avoir défini l'environnement et les principaux composants, intéressons-nous au réflexe myotatique précisément. Comme nous l'avons vu plus haut, il s'agit d'un réflexe, déclenché par un choc. Le stimulus (choc) contre le muscle provoque un bref étirement du muscle. Cette variation de son état est captée par les dendrites d'un neurone sensitif qui sont ancrées dans le muscle puis convertie en message nerveux (afflux électrique) et remonte dans le centre nerveux situé dans la moelle épinière.<\/p>\r\n\r\n<p>\r\nLe message nerveux afférent est constitué de brefs pics (de l'ordre de la milliseconde) que l'on appelles potentiel d'action (mesuré en Millivolt). Le message se transmet rapidement puisqu'il voyage à environ 100 m\/s.<\/p>\r\n\r\n<p>\r\nAprès avoir été traitée, l'information portée par le potentiel d'action repart dans le neurone moteur, dit neurone efférent. Arrivé au synapse, le message est converti en potentiel chimique, engendrant la libération d'un neuromédiateur, l'acétylcholine. La libération d'une certaine concentration de neuromédiateur par les vésicules dans la fente synaptique (processus appelé l'exocytose) sera conditionnée par la fréquence du potentiel d'action.<\/p>\r\n\r\n<p>\r\nC'est ainsi que les médicaments dits \"myorelaxants\" sont des antagonistes de l'acétylcholine. Ils se fixent sur les récepteurs sans générer de réflexe musculaire (donc de potentiel d'action). Le plus célèbre des myorelaxant est le curare, utilisé par les indiens d'Amérique pour chasser. La proie touchée par une flèche enduite de curare meurt asphyxiée à cause de la paralysie musculaire. A l'inverse, les agonistes de l'acétylcholine vont augmenter la durée de vie  du neurotransmetteur dans la fente synaptique.<\/p>","tags":["svt"," biologie"],"date":"28\/12\/2021 - 18:55","is-draft":true}