{"title":"Spinoza: déterminisme et Conatus","ID":"spinoza-conatus","content":"<p>Baruch Spinoza est un philosophe Hollandais du 17ème\r\nsiècle. Né dans une famille juive marrane d'origine\r\nportugaise, il s'attire les foudres de certains membres de la\r\ncommunauté par sa fréquentation des érudits et\r\nintellectuels. Frappé par une sorte d'excommunication (le Herem), il\r\nquitte Amsterdam et s'installe à Rijnsburg où il taille des\r\nlentilles d'optiques et écrit plusieurs ouvrages. Son œuvre la\r\nplus importante reste l' Ethique, écrit tout au long de sa vie et\r\npubliée après sa mort dans laquelle il traite de Dieu, des\r\npassions et de l'Homme. On retiendra deux concepts majeurs de ce philosophe\r\n: le conatus et le déterminisme.<\/p>\r\n\r\n<p>\r\nLe déterminisme est un courant philosophique que l'on retrouve\r\nd'abord chez les Stoïciens sous la forme du destin, le fatum stoicum,\r\nlittéralement le \"destin stoïque\". Du mot latin\r\n\"fatum\" dérive également le mot\r\n\"fatalisme\", c’est-à-dire ce qui est\r\ninévitable quel que soient mes actes. Cette doctrine s'oppose au\r\ndéterminisme qui est dit causal, c’est-à-dire que\r\ncontrairement au fatalisme, un évènement peut ne pas se\r\nproduire si les conditions ne sont pas réunies. Le fatalisme, s'est\r\nvu objecté beaucoup d'arguments, dont le principal est moral. En\r\neffet, la perte de liberté engendrée par le fatalisme est un\r\nexutoire facile dans la mesure où allège l'Homme de toutes\r\nresponsabilités morales. Néanmoins, avant de\r\ns'intéresser au déterminisme de Spinoza, revenons au point de\r\ndépart de sa philosophie.<\/p>\r\n\r\n<p>\r\nLa thèse centrale de Spinoza est qu'il n'existe qu'une seule\r\nsubstance : celle issue de Dieu. Sa célèbre citation\r\n\"Deus Sive Natura\" - Dieu c’est-à-dire la\r\nNature\" reflète cette forme de Monisme. Cette substance\r\npossède une infinité d'attributs (de caractères) mais\r\nseuls deux nous sont accessibles d'un point de vue ontologique : la\r\nPensée et l'Etendue (on passe donc d'un monisme à un\r\ndualisme). La pensée possède des \"modes\" tel que\r\nles idées (chaque idée est un mode de notre pensée) ou\r\nbien notre âme tandis que l'étendue, concept mainte fois\r\nrencontré en philosophie à trait aux objets matériels\r\nque nous rencontrons physiquement.<\/p>\r\n\r\n<p>\r\nLes attributs - pour nous la pensée et l'étendue - sont dits\r\nparallèles, c’est-à-dire que l'un n'est pas\r\nsupérieur à l'autre, mais que toute modification de l'un\r\nentraine la modification de l'autre (dans l'absolu, de tous les autres\r\nétant donné qu'il existe une infinité d'attributs).\r\nAinsi, je peux physiquement ressentir la joie d'un évènement\r\nau départ purement émotionnel, c’est-à-dire \r\nissu d'un mode de la pensée. Quand deux idées ou deux corps\r\nse rencontrent, il y existe deux issues possibles : soit l'un des deux est\r\ndétruit soit ils se composent pour former un ensemble plus puissant.\r\nCependant, nous nous avérons incapable de déterminer\r\nl'origine des évènements - que nous subissons. Nous nous\r\nlimitons par notre constitution humaine à l'étude des\r\nconséquences sans pouvoir toucher aux causes (c'est d'ailleurs ce\r\nqui justifie le terme de déterminisme). Dans ces conditions, pour\r\néchapper à l'angoisse de l'ignorance, nous allons\r\ninterpréter les conséquences ce qui aboutit à une\r\npremière illusion : celle du libre arbitre. La conscience se\r\nconsidère comme cause première alors qu'elle est\r\ninfluencée par les événements extérieurs.  La\r\nseconde illusion, basée sur l'interprétation erronée\r\ndes conséquences prises pour des causes nous amène à\r\nconsidérer le monde comme conçu pour nous,\r\nc’est-à-dire que la finalité du monde nous est\r\ndestinée.<\/p>\r\n\r\n<p>\r\nNéanmoins, si la conscience s'illusionne, c'est qu'elle agit,\r\nqu'elle est active. C'est le conatus spinozien qui est un effort de\r\npersévérance dans son être, c’est-à-dire\r\nce qui pousse la conscience à être conscience ou un arbre\r\nà rester arbre ; il s'agit, du propre aveu de Spinoza de l'essence\r\nde la chose considérée. Il n'existe ainsi pas un conatus\r\nparticulier mais une infinité (autant qu'il existe d'attributs) ;\r\nc'est ainsi que la nature naturante est le conatus de l'être divin. A\r\nnoter que cette nature naturante est aussi nature naturée en tant\r\nque résultat de sa propre production (Deus Sive Natura).<\/p>\r\n\r\n<p>\r\nSi le libre arbitre se voit ainsi réfuté par le\r\ndéterminisme spinozien, ce n'est pas le cas de la liberté.\r\nÊtre libre selon Spinoza, c'est suivre ses propres contraintes, donc\r\nles contraintes imposées par notre conatus. Une contrainte\r\nextérieur, ne venant donc pas de mon conatus restreindra ainsi ma\r\nliberté : c'est le cas des passions, résultant de l'action\r\ndes modes extérieurs sur nous. Le problème vient du fait que\r\nl'Homme est nécessairement ignorant de sa nature et donc de son\r\nconatus. A ce niveau, l'on distingue trois type de personnes : l'esclave\r\ndes passions, celui qui les exploites, le prêtre, complice de\r\nl'ignorance humaine. Cette vision, pessimiste sur la nature de l'Homme se\r\nretrouvera chez Nietzsche.\r\n<\/p>\r\n\r\n<p>\r\nFinalement, comme l'indique le titre de son ouvrage, le but de Spinoza est\r\nd'établir une éthique et non une morale. La morale fait\r\nréférence à un ensemble de normes  relative à\r\ndes valeurs sociétales. L'éthique fait quant à elle\r\nréférence à la visée d'une action et\r\nnécessite de prendre conscience de l'autre comme une fin en soi.\r\nDonc, pour réaliser cette éthique, au lieu de mettre en place\r\nune philosophie manichéenne basée sur la dualité\r\nbien\/mal, Spinoza utilise le rapport bon ou mauvais pour l'individu. Tandis\r\nque le bon est favorable au conatus, le mauvais lui fait opposition et le\r\nréduit. Il s'agit donc d'un rapport subjectif considérant\r\nl'individu en lui-même. Cependant, le rapport bon\/mauvais\r\ndébouche sur une conclusion évidente : les individus qui\r\nrecherchent l'amélioration de leur conatus sont \"bons\"\r\ntandis que ceux qui, esclaves de l'ignorance, font des choix\r\ninconsidérés, sont mauvais.<\/p>\r\n\r\n<p>\r\nD'une manière concise, l'Homme possède un conatus mais n'en\r\nest généralement pas conscient. Ce conatus est l'essence de\r\ncet Homme et le conduit à réaliser certaines actions.\r\nNéanmoins, des influences externes diminuent la force du conatus. Le\r\nmonde étant déterminé (c’est-à-dire\r\nrégit par le principe de causalité), la contrainte de son\r\npropre conatus reste le seul moyen de conserver sa liberté\r\nmalgré l'absence de libre-arbitre (je suis libre car je me contraint\r\nmoi-même, néanmoins, étant donné que mon action\r\nest conditionnée par une cause antérieure, je n'ai pas de\r\nlibre arbitre).<\/p>","tags":["philosophie"," spinoza"," conatus"],"date":"28\/12\/2021 - 18:55","is-draft":true}